app/controllers/servers_controller.rb

INSERT INTO "servers" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tammy"], ["password_digest", "$2a$10$rwOsVBA8FIDffGRJvIeyN.yCcHw830zhkI2vLDIbyyjy0w44UUs6."], ["created_at", "2016-04-22 18:18:22.903972"], ["updated_at", "2016-04-22 18:18:22.903972"]]
---
  def create
    Server.create(server_params)